#include <math.h>
#include <new>
#include <distingnt/api.h>
#define AIRWINDOWS_NAME "NonlinearSpace"
#define AIRWINDOWS_DESCRIPTION "A flexible reverb plugin."
#define AIRWINDOWS_GUID NT_MULTICHAR( 'A','N','o','n' )
#define AIRWINDOWS_TAGS kNT_tagEffect | kNT_tagReverb
enum {

	kParam_One =0,
	kParam_Two =1,
	kParam_Three =2,
	kParam_Four =3,
	kParam_Five =4,
	kParam_Six =5,
	//Add your parameters here...
	kNumberOfParameters=6
};
static const int k16 = 1;
static const int k32 = 2;
static const int k44 = 3;
static const int k48 = 4;
static const int k64 = 5;
static const int k88 = 6;
static const int k96 = 7;
static const int kDefaultValue_ParamOne = k44;
enum { kParamInputL, kParamInputR, kParamOutputL, kParamOutputLmode, kParamOutputR, kParamOutputRmode,
kParamPrePostGain,
kParam0, kParam1, kParam2, kParam3, kParam4, kParam5, };
static char const * const enumStrings0[] = { "", "16K", "32K", "44.1K", "48K", "64K", "88.2K", "96K", };
static const uint8_t page2[] = { kParamInputL, kParamInputR, kParamOutputL, kParamOutputLmode, kParamOutputR, kParamOutputRmode };
static const uint8_t page3[] = { kParamPrePostGain };
static const _NT_parameter	parameters[] = {
NT_PARAMETER_AUDIO_INPUT( "Input L", 1, 1 )
NT_PARAMETER_AUDIO_INPUT( "Input R", 1, 2 )
NT_PARAMETER_AUDIO_OUTPUT_WITH_MODE( "Output L", 1, 13 )
NT_PARAMETER_AUDIO_OUTPUT_WITH_MODE( "Output R", 1, 14 )
{ .name = "Pre/post gain", .min = -36, .max = 0, .def = -20, .unit = kNT_unitDb, .scaling = kNT_scalingNone, .enumStrings = NULL },
{ .name = "Sample Rate", .min = 1, .max = 7, .def = 3, .unit = kNT_unitEnum, .scaling = kNT_scalingNone, .enumStrings = enumStrings0 },
{ .name = "Liveness", .min = 0, .max = 1000, .def = 500, .unit = kNT_unitNone, .scaling = kNT_scaling1000, .enumStrings = NULL },
{ .name = "Treble", .min = 0, .max = 1000, .def = 500, .unit = kNT_unitNone, .scaling = kNT_scaling1000, .enumStrings = NULL },
{ .name = "Bass", .min = 0, .max = 1000, .def = 500, .unit = kNT_unitNone, .scaling = kNT_scaling1000, .enumStrings = NULL },
{ .name = "Nonlin", .min = -1000, .max = 1000, .def = 0, .unit = kNT_unitNone, .scaling = kNT_scaling1000, .enumStrings = NULL },
{ .name = "Dry/Wet", .min = 0, .max = 1000, .def = 1000, .unit = kNT_unitNone, .scaling = kNT_scaling1000, .enumStrings = NULL },
};
static const uint8_t page1[] = {
kParam0, kParam1, kParam2, kParam3, kParam4, kParam5, };
enum { kNumTemplateParameters = 7 };
#include "../include/template1.h"
 
	Float32 avgInputL;
	Float32 avgOutputL;
	Float32 avg2InputL;
	Float32 avg2OutputL;
	Float32 avgInputR;
	Float32 avgOutputR;
	Float32 avg2InputR;
	Float32 avg2OutputR;
	Float32 a2vgInputL;
	Float32 a2vgOutputL;
	Float32 a2vg2InputL;
	Float32 a2vg2OutputL;
	Float32 a2vgInputR;
	Float32 a2vgOutputR;
	Float32 a2vg2InputR;
	Float32 a2vg2OutputR;
	
	Float32 verboutL;
	Float32 verboutR;
	Float32 iirCCSampleL;
	Float32 iirCCSampleR;
	Float32 iirSampleL;
	Float32 iirSampleR;
	
	
	
	
	Float32 interpolA, pitchshiftA; //7575
	Float32 interpolB, pitchshiftB; //7309
	Float32 interpolC, pitchshiftC; //7179
	Float32 interpolD, pitchshiftD; //6909		
	Float32 interpolE, pitchshiftE; //6781
	Float32 interpolF, pitchshiftF; //6523
	Float32 interpolG, pitchshiftG; //5983
	Float32 interpolH, pitchshiftH; //5565
	Float32 interpolI, pitchshiftI; //5299
	Float32 interpolJ, pitchshiftJ; //4905
	Float32 interpolK, pitchshiftK; //4761
	Float32 interpolL, pitchshiftL; //4491
	Float32 interpolM, pitchshiftM; //4393
	Float32 interpolN, pitchshiftN; //4231
	Float32 interpolO, pitchshiftO; //4155
	Float32 interpolP, pitchshiftP; //3991
	Float32 interpolQ, pitchshiftQ; //3661
	Float32 interpolR, pitchshiftR; //3409
	Float32 interpolS, pitchshiftS; //3253
	Float32 interpolT, pitchshiftT; //3001
	Float32 interpolU, pitchshiftU; //2919
	Float32 interpolV, pitchshiftV; //2751
	Float32 interpolW, pitchshiftW; //2505
	Float32 interpolX, pitchshiftX; //2425
	Float32 interpolY, pitchshiftY; //2148
	Float32 interpolZ, pitchshiftZ; //2090
	
	int oneMid, delayMid, maxdelayMid;
	int oneSide, delaySide, maxdelaySide;
	int oneLeft, delayLeft, maxdelayLeft;
	int oneRight, delayRight, maxdelayRight;
	
	int onepre, delaypre, maxdelaypre;
	
	int oneA, twoA, treA, delayA, maxdelayA;
	int oneB, twoB, treB, delayB, maxdelayB;
	int oneC, twoC, treC, delayC, maxdelayC;
	int oneD, twoD, treD, delayD, maxdelayD;
	int oneE, twoE, treE, delayE, maxdelayE;
	int oneF, twoF, treF, delayF, maxdelayF;
	int oneG, twoG, treG, delayG, maxdelayG;
	int oneH, twoH, treH, delayH, maxdelayH;
	int oneI, twoI, treI, delayI, maxdelayI;
	int oneJ, twoJ, treJ, delayJ, maxdelayJ;
	int oneK, twoK, treK, delayK, maxdelayK;
	int oneL, twoL, treL, delayL, maxdelayL;
	int oneM, twoM, treM, delayM, maxdelayM;
	int oneN, twoN, treN, delayN, maxdelayN;
	int oneO, twoO, treO, delayO, maxdelayO;
	int oneP, twoP, treP, delayP, maxdelayP;
	int oneQ, twoQ, treQ, delayQ, maxdelayQ;
	int oneR, twoR, treR, delayR, maxdelayR;
